Tekla.Structures.ModelInternal.Dstv.DstvViewType
The dstv view type.

Tekla.Structures.ModelInternal.Dstv.DstvViewType.v
Front view

Tekla.Structures.ModelInternal.Dstv.DstvViewType.o
Top view

Tekla.Structures.ModelInternal.Dstv.DstvViewType.u
Bottom view

Tekla.Structures.ModelInternal.Dstv.DstvViewType.h
Behind view

Tekla.Structures.ModelInternal.Dstv.DstvViewType.CUSTOM_VIEW
Other types of view